'''
just_small_expiriments

тут я рассмотрю как классифицирует данные линейная регрессия, рассмотрим следующие две группы:

деревья "0" и деревья "1"
деревья "0": высота 6-15 метров; размах веток 1.2 - 3 метра
деревья "1": высота 9-21 метр; размах веток 2.0 - 5 метров

По just_small_expiriments я вижу, что линейно разделимые данные хорошо разбираются. у меня возникли трудности по
построению линии регрессии так как там 3 измерения (зависит от двух признаков), как это можно решить я не нашел,
кажется я должен как-то спроецировать точки в одно измерение, но как спроецировать точки?
Возможно это делается как-то через радиус-вектор, но мне пока что лень проверять, а так в целом я посмотрел как она работает,
теперь надо попробовать написать саму модель самому.
'''